app/controllers/chatroom_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@message = Message.new
		@messages = Message.custom_display
		@users = User.all